[{"url": "http://arimaa.com/arimaa/challenge/",
"title": "The Arimaa Challenge",
"tag_line": "The first person, company, or organization to develop a program that can defeat the top human players in Arimaa before 2020 will win the challenge.",
"summary": "We are offering a prize of at least $10,000 USD (current prize may be more) until 2020 to the first person, company or organization who develops a program that can defeat three selected human players in an official Arimaa match. The match will consist of at least 3 games against each of the three players. The program must be able to run on a general-purpose, off-the-shelf computer and not require any specialized hardware.\n    We invite participants from Universities, Corporations and also individuals around the world to see if they can develop the best Arimaa playing program. Each January a tournament will be held to determine the best Arimaa playing program. The winner of that tournament will receive a prize and a chance to try for the $10,000 grand challenge of defeating human players. We especially would like to encourage teams from Universities around the world to participate. The contest will be fun and interesting.\n Arimaa demonstrates that when it comes to serious game playing, humans still dominate. By offering this challenge we hope to increase the awareness that the difficult problem of teaching computers to play strategy games has not yet been tackled. There is much work that needs to be done in understanding how humans play strategy games and producing similar capability in software. We hope this challenge will spur some new and radically different ways of replicating this astonishing human capability in software. The breakthroughs that will come from such research can have significant applications in a wide variety of fields.",
"rules": "Object of the Game\n    Be the first to get one of your rabbits to the other side of the board.\n    Material\n    Arimaa is designed so that it can easily be played using a standard chess set. To make the game easier to learn for someone who is not familiar with chess, the chess pieces are substituted with well known animals. The substitution is as follows: elephant for king, camel for queen, horse for rook, dog for bishop, cat for knight and rabbit for pawn. The elephant is the strongest followed by camel, horse, dog, cat and rabbit. Coins need to placed on squares c3, f3, c6 and f6 of the chess board to mark these as special trap squares (explained later).\n    Setup\n    The game starts with an empty board. The player with the gold pieces sets them on the first two rows closest to that player. There is no fixed starting position so the pieces may be placed in any arrangement. But it is suggested that most of the stronger pieces be placed in front of the weaker rabbits. Once the gold player has finished the silver player sets the pieces on the two closest rows. Again the pieces may be placed in any arrangement within the first two rows.\n    Play\n    The players take turns moving their pieces with the gold player going first. All pieces move the same way: in orthogonal directions (like rooks in chess) forward, backward, left and right. But the rabbits cannot move backward (like pawns in chess). On each turn a player can move the pieces a total of four steps. Moving one piece from its current square to the next adjacent square counts as one step. A piece can take multiple steps and also change directions after each step. The steps may be distributed among multiple pieces so that up to four pieces can be moved. A player may pass some of the steps, but may not pass the whole turn or make a move equivalent to passing the whole turn.\n    The stronger pieces can move opponent's weaker pieces. For example your dog can move the opponent's cat or rabbit, but not the opponent's dog or any other piece that is stronger than it. The opponent's piece must be orthogonally adjacent to your piece and can be moved by either pushing or pulling it. To push an opponent's piece with your stronger piece, first move the opponent's piece to one of the empty orthogonally adjacent squares and then move your piece into its place. To pull an opponent's piece with your stronger piece, first move your piece to one of the unoccupied adjacent squares and then move the opponent's piece into the square that was just vacated. Although rabbits cannot move backwards on their own, they may be pushed or pulled back. A push or pull requires two consecutive steps and must be completed within the same turn. Any combination of pushing and pulling can be done in the same turn. However when your stronger piece is completing a push it cannot pull an opponent's weaker piece along with it.\n    A stronger piece can also freeze any opponent's piece that is weaker than it. A piece which is next to an opponent's stronger piece is considered to be frozen and cannot move on its own; though it can be pushed or pulled by opponents stronger pieces. However if there is a friendly piece next to it the piece is unfrozen and is free to move.\n    There are four distinctly marked traps squares on the board (c3, f3, c6 and f6 in standard notation). Any piece that is on a trap square is immediately removed from the game unless there is a friendly piece next to the trap square to keep it safe. Be careful not to lose your own pieces in the traps.\n    Special Situations\n    A push or pull is considered atomic as if the two pieces are moved simultaneously. Thus it is possible for the pulling piece to step into a trap and be removed from the game while completing the pull.\n    A player may push or pull the opponent's rabbit into the goal row it is trying to reach. If at the end of the turn the rabbit remains there, the player loses. However if the opponent's rabbit is moved back out of the goal row before the end of the turn, the player does not lose.\n    If a player is unable to make a move because all the pieces are frozen or have no place to move, then that player has lost the game.\n    If after a turn the same board position and side to move would occur for the third time, then that move is illegal and the player must select a different move. If in the rare case the only moves a player has are not allowed then the player loses due to being unable to make a move.\n    If a player loses all the rabbits then that player loses the game. If in the rare case both players lose all rabbits on the same move then the player making the move wins the game.\n    Notes\n    The order of checking for win/lose conditions is as follows assuming player A just made the move and player B now needs to move:\n    Check if a rabbit of player A reached goal. If so player A wins.\n    Check if a rabbit of player B reached goal. If so player B wins.\n    Check if player B lost all rabbits. If so player A wins.\n    Check if player A lost all rabbits. If so player B wins.\n    Check if player B has no possible move (all pieces are frozen or have no place to move). If so player A wins.\n    Check if the only moves player B has are 3rd time repetitions. If so player A wins.\n    Reference URLs:\n    http://arimaa.com/arimaa/learn/matchRules.html\n    http://arimaa.com/arimaa/learn/",
"eligibility": "",
"fee": "",
"awards_attributes": [{"value": "$17,000", "description": "Note: Award value varies per year."}],
"deadlines_attributes": [{"date": "2014 (TBD)", "description": "Note: The 2013 competition has ended without a winner. See website for upcoming 2014 Competition."}],
"post_date": "January, 1, 2004",
"image_url": "http://arimaa.com/arimaa/graphics/animals/WE.gif",
"sponsor": "Omar Syed",
"contact_info": "http://arimaa.com/arimaa/contact/",
"topic": "Artificial Intelligence\n    Computer Science\n    Games",
"structure": "Tournament\n    Annual\n    Until Prize is Claimed",
"resultant": "Winner\n    Open Source?",
"xpath_check": "http://arimaa.com/arimaa/challenge/html/body/table/tbody/tr/td[2]/blockquote/table/tbody/tr/td/p[3]"
},{"url": "http://www.claymath.org/millennium/Birch_and_Swinnerton-Dyer_Conjecture/",
"title": "The Birch and Swinnerton-Dyer Conjecture",
"tag_line": "A Millennium Prize Problem",
"summary": "Overview: In order to celebrate mathematics in the new millennium, The Clay Mathematics Institute of Cambridge, Massachusetts (CMI) established seven Prize Problems. The Prizes were conceived to record some of the most difficult problems with which mathematicians were grappling at the turn of the second millennium; to elevate in the consciousness of the general public the fact that in mathematics, the frontier is still open and abounds in important unsolved problems; to emphasize the importance of working towards a solution of the deepest, most difficult problems; and to recognize achievement in mathematics of historical magnitude. \nThe prizes were announced at a meeting in Paris, held on May 24, 2000 at the Collège de France. Three lectures were presented: Timothy Gowers spoke on The Importance of Mathematics; Michael Atiyah and John Tate spoke on the problems themselves. \nThe seven Millennium Prize Problems were chosen by the founding Scientific Advisory Board of CMI, which conferred with leading experts worldwide. The focus of the board was on important classic questions that have resisted solution for many years. \nFollwing the decision of the Scientific Advisory Board, the Board of Directors of CMI designated a $7 million prize fund for the solution to these problems, with $1 million allocated to the solution of each problem. \nIt is of note that one of the seven Millennium Prize Problems, the Riemann hypothesis, formulated in 1859, also appears in the list of twenty-three problem discuss in the address given in Paris by David Hilbert on August 9, 1900. \n\nThe Birch and Swinnerton-Dyer Conjecture: \nMathematicians have always been fascinated by the problem of describing all solutions in whole numbers x,y,z to algebraic equations like x^2 + y^2 = z^2. Euclid gave the complete solution for that equation, but for more complicated equations this becomes extremely difficult. Indeed, in 1970 Yu. V. Matiyasevich showed that Hilbert's tenth problem is unsolvable, i.e., there is no general method for determining when such equations have a solution in whole numbers. But in special cases one can hope to say something. When the solutions are the points of an abelian variety, the Birch and Swinnerton-Dyer conjecture asserts that the size of the group of rational points is related to the behavior of an associated zeta function ζ(s) near the point s=1. In particular this amazing conjecture asserts that if ζ(1) is equal to 0, then there are an infinite number of rational points (solutions), and conversely, if ζ(1) is not equal to 0, then there is only a finite number of such points.",
"rules": "The SAB of CMI will consider a proposed solution to a Millennium Prize Problem if it is a complete mathematical solution to one of the problems. (In the case that someone discovers a mathematical counterexample, rather than a proof, the question will be considered separately as described below.) A proposed solution to one of the Millennium Prize Problems may not be submitted directly to CMI for consideration.\nBefore consideration, a proposed solution must be published in a refereed mathematics publication of worldwide repute (or such other form as the SAB shall determine qualifies), and it must also have general acceptance in the mathematics community two years after. Following this two-year waiting period, the SAB will decide whether a solution merits detailed consideration. In the affirmative case, the SAB will constitute a special advisory committee, which will include (a) at least one SAB member and (b) at least two non-SAB members who are experts in the area of the problem. The SAB will seek advice to determine potential non-SAB members who are internationally-recognized mathematical experts in the area of the problem. As part of this procedure, each component of a proposed solution under consideration shall be verified by one or more members of this special advisory committee. \nThe special advisory committee will report within a reasonable time to the SAB. Based on this report and possible further investigation, the SAB will make a recommendation to the Directors. The SAB may recommend the award of a prize to one person. The SAB may recommend that a particular prize be divided among multiple solvers of a problem or their heirs. The SAB will pay special attention to the question of whether a prize solution depends crucially on insights published prior to the solution under consideration. The SAB may (but need not) recommend recognition of such prior work in the prize citation, and it may (but need not) recommend the inclusion of the author of prior work in the award. \n\nIf the SAB cannot come to a clear decision about the correctness of a solution to a problem, its attribution, or the appropriateness of an award, the SAB may recommend that no prize be awarded for a particular problem. If new information comes to light, the SAB may (but will not necessarily) reconsider a negative decision to recommend a prize for a proposed solution, but only after an additional two-year waiting period following the time that the new information comes to light. The SAB has the sole authority to make recommendations to the Directors of the CMI concerning the appropriateness of any award and the validity of any claim to the CMI Millennium Prize.\n\nIn the case of the P versus NP problem and the Navier-Stokes problem, the SAB will consider the award of the Millennium Prize for deciding the question in either direction. In the case of the other problems if a counterexample is proposed, the SAB will consider this counterexample after publication and the same two-year waiting period as for a proposed solution will apply. If, in the opinion of the SAB, the counterexample effectively resolves the problem then the SAB may recommend the award of the Prize. If the counterexample shows that the original problem survives after reformulation or elimination of some special case, then the SAB may recommend that a small prize be awarded to the author. The money for this prize will not be taken from the Millennium Prize Problem fund, but from other CMI funds.\nAny person who is not a disqualified person (as that term is defined in section 4946 of the Internal Revenue Code) in connection with the Institute, or a then serving member of the SAB, may receive the Millennium Prize. \nAll decision-making procedures concerning the CMI Millennium Prize Problems are private. This includes the deliberations or recommendations of any person or persons CMI has used to obtain advice on this question. No records of these deliberations or related correspondence may be made public without the prior approval of the Directors, the SAB, and all other living persons involved, unless fifty years time have elapsed after the event in question.\nNotwithstanding the wording of the problem descriptions, the SAB will not consider recommending the award of a prize to any individual who has not, in the judgement of SAB, made a major personal contribution to the understanding of the field of the problem in their published solution; nor will it investigate in detail solutions that do not represent a major advance in the field. Conversely, the SAB may consider recommending the award of the prize to an individual who has published work that, in the judgement of the SAB, fully resolves the questions raised by one of the Millennium Prize Problems even if it does not exactly meet the wording in the official problem description. \n\nReference URLs: http://www.claymath.org/millennium/Birch_and_Swinnerton-Dyer_Conjecture/birchswin.pdf",
"eligibility": "",
"fee": "",
"awards_attributes": [{"value": "$1,000,000", "description": ""}],
"deadlines_attributes": [{"date": "None", "description": ""}],
"post_date": "May, 24th 2000",
"image_url": "http://www.claymath.org/images/sculpture.gif",
"sponsor": "Clay Mathematics Institute",
"contact_info": "Corporate Address: \nClay Mathematics Institute \n10 Memorial Blvd.\nSuite 902\nProvidence, RI 02903\nUSA\n\nPlease send inquiries regarding the Millennium Prize Problems to admin@claymath.org \n\nTelephone: +44 (0)1865 615155\nFax: +44 (0)1865 615101",
"topic": "Math",
"structure": "Until Prize is Claimed \nPublication",
"resultant": "Open Source",
"xpath_check": "http://www.claymath.org/millennium/Birch_and_Swinnerton-Dyer_Conjecture/html/body/div[4]/div/p[3]\nhttp://www.claymath.org/millennium/Rules_etc/html/body/div[4]/div/p[11]/em"
},{"url": "http://www.claymath.org/millennium/Hodge_Conjecture/",
"title": "The Hodge Conjecture",
"tag_line": "A Millennium Prize Problem",
"summary": "Overview: \nIn order to celebrate mathematics in the new millennium, The Clay Mathematics Institute of Cambridge, Massachusetts (CMI) established seven Prize Problems. The Prizes were conceived to record some of the most difficult problems with which mathematicians were grappling at the turn of the second millennium; to elevate in the consciousness of the general public the fact that in mathematics, the frontier is still open and abounds in important unsolved problems; to emphasize the importance of working towards a solution of the deepest, most difficult problems; and to recognize achievement in mathematics of historical magnitude. \nThe prizes were announced at a meeting in Paris, held on May 24, 2000 at the Collège de France. Three lectures were presented: Timothy Gowers spoke on The Importance of Mathematics; Michael Atiyah and John Tate spoke on the problems themselves. \nThe seven Millennium Prize Problems were chosen by the founding Scientific Advisory Board of CMI, which conferred with leading experts worldwide. The focus of the board was on important classic questions that have resisted solution for many years. \nFollwing the decision of the Scientific Advisory Board, the Board of Directors of CMI designated a $7 million prize fund for the solution to these problems, with $1 million allocated to the solution of each problem. \nIt is of note that one of the seven Millennium Prize Problems, the Riemann hypothesis, formulated in 1859, also appears in the list of twenty-three problem discuss in the address given in Paris by David Hilbert on August 9, 1900. \n\nThe Navier-Stokes Equation: \nWaves follow our boat as we meander across the lake, and turbulent air currents follow our flight in a modern jet. Mathematicians and physicists believe that an explanation for and the prediction of both the breeze and the turbulence can be found through an understanding of solutions to the Navier-Stokes equations. Although these equations were written down in the 19th Century, our understanding of them remains minimal. The challenge is to make substantial progress toward a mathematical theory which will unlock the secrets hidden in the Navier-Stokes equations.",
"rules": "The SAB of CMI will consider a proposed solution to a Millennium Prize Problem if it is a complete mathematical solution to one of the problems. (In the case that someone discovers a mathematical counterexample, rather than a proof, the question will be considered separately as described below.) A proposed solution to one of the Millennium Prize Problems may not be submitted directly to CMI for consideration.\nBefore consideration, a proposed solution must be published in a refereed mathematics publication of worldwide repute (or such other form as the SAB shall determine qualifies), and it must also have general acceptance in the mathematics community two years after. Following this two-year waiting period, the SAB will decide whether a solution merits detailed consideration. In the affirmative case, the SAB will constitute a special advisory committee, which will include (a) at least one SAB member and (b) at least two non-SAB members who are experts in the area of the problem. The SAB will seek advice to determine potential non-SAB members who are internationally-recognized mathematical experts in the area of the problem. As part of this procedure, each component of a proposed solution under consideration shall be verified by one or more members of this special advisory committee. \nThe special advisory committee will report within a reasonable time to the SAB. Based on this report and possible further investigation, the SAB will make a recommendation to the Directors. The SAB may recommend the award of a prize to one person. The SAB may recommend that a particular prize be divided among multiple solvers of a problem or their heirs. The SAB will pay special attention to the question of whether a prize solution depends crucially on insights published prior to the solution under consideration. The SAB may (but need not) recommend recognition of such prior work in the prize citation, and it may (but need not) recommend the inclusion of the author of prior work in the award. \n\nIf the SAB cannot come to a clear decision about the correctness of a solution to a problem, its attribution, or the appropriateness of an award, the SAB may recommend that no prize be awarded for a particular problem. If new information comes to light, the SAB may (but will not necessarily) reconsider a negative decision to recommend a prize for a proposed solution, but only after an additional two-year waiting period following the time that the new information comes to light. The SAB has the sole authority to make recommendations to the Directors of the CMI concerning the appropriateness of any award and the validity of any claim to the CMI Millennium Prize.\n\nIn the case of the P versus NP problem and the Navier-Stokes problem, the SAB will consider the award of the Millennium Prize for deciding the question in either direction. In the case of the other problems if a counterexample is proposed, the SAB will consider this counterexample after publication and the same two-year waiting period as for a proposed solution will apply. If, in the opinion of the SAB, the counterexample effectively resolves the problem then the SAB may recommend the award of the Prize. If the counterexample shows that the original problem survives after reformulation or elimination of some special case, then the SAB may recommend that a small prize be awarded to the author. The money for this prize will not be taken from the Millennium Prize Problem fund, but from other CMI funds.\nAny person who is not a disqualified person (as that term is defined in section 4946 of the Internal Revenue Code) in connection with the Institute, or a then serving member of the SAB, may receive the Millennium Prize. \nAll decision-making procedures concerning the CMI Millennium Prize Problems are private. This includes the deliberations or recommendations of any person or persons CMI has used to obtain advice on this question. No records of these deliberations or related correspondence may be made public without the prior approval of the Directors, the SAB, and all other living persons involved, unless fifty years time have elapsed after the event in question.\nNotwithstanding the wording of the problem descriptions, the SAB will not consider recommending the award of a prize to any individual who has not, in the judgement of SAB, made a major personal contribution to the understanding of the field of the problem in their published solution; nor will it investigate in detail solutions that do not represent a major advance in the field. Conversely, the SAB may consider recommending the award of the prize to an individual who has published work that, in the judgement of the SAB, fully resolves the questions raised by one of the Millennium Prize Problems even if it does not exactly meet the wording in the official problem description. \n\nReference URLs: http://www.claymath.org/millennium/Hodge_Conjecture/hodge.pdf",
"eligibility": "",
"fee": "",
"awards_attributes": [{"value": "$1,000,000", "description": ""}],
"deadlines_attributes": [{"date": "None", "description": ""}],
"post_date": "May, 24th 2000",
"image_url": "http://www.claymath.org/images/sculpture.gif",
"sponsor": "Clay Mathematics Institute",
"contact_info": "Corporate Address: \nClay Mathematics Institute \n10 Memorial Blvd.\nSuite 902\nProvidence, RI 02903\nUSA\n\nPlease send inquiries regarding the Millennium Prize Problems to admin@claymath.org \n\nTelephone: +44 (0)1865 615155\nFax: +44 (0)1865 615101",
"topic": "Math",
"structure": "Until Prize is Claimed \nPublication",
"resultant": "Open Source",
"xpath_check": "http://www.claymath.org/millennium/Hodge_Conjecture/html/body/div[4]/div/p \nhttp://www.claymath.org/millennium/Rules_etc/html/body/div[4]/div/p[11]/em "
},{"url": "http://www.claymath.org/millennium/Navier-Stokes_Equations/",
"title": "The Navier-Stokes Equation",
"tag_line": "A Millennium Prize Problem",
"summary": "Overview: \nIn order to celebrate mathematics in the new millennium, The Clay Mathematics Institute of Cambridge, Massachusetts (CMI) established seven Prize Problems. The Prizes were conceived to record some of the most difficult problems with which mathematicians were grappling at the turn of the second millennium; to elevate in the consciousness of the general public the fact that in mathematics, the frontier is still open and abounds in important unsolved problems; to emphasize the importance of working towards a solution of the deepest, most difficult problems; and to recognize achievement in mathematics of historical magnitude. \nThe prizes were announced at a meeting in Paris, held on May 24, 2000 at the Collège de France. Three lectures were presented: Timothy Gowers spoke on The Importance of Mathematics; Michael Atiyah and John Tate spoke on the problems themselves. \nThe seven Millennium Prize Problems were chosen by the founding Scientific Advisory Board of CMI, which conferred with leading experts worldwide. The focus of the board was on important classic questions that have resisted solution for many years. \nFollwing the decision of the Scientific Advisory Board, the Board of Directors of CMI designated a $7 million prize fund for the solution to these problems, with $1 million allocated to the solution of each problem. \nIt is of note that one of the seven Millennium Prize Problems, the Riemann hypothesis, formulated in 1859, also appears in the list of twenty-three problem discuss in the address given in Paris by David Hilbert on August 9, 1900. \n\nThe Hodge Conjecture: \nIn the twentieth century mathematicians discovered powerful ways to investigate the shapes of complicated objects. The basic idea is to ask to what extent we can approximate the shape of a given object by gluing together simple geometric building blocks of increasing dimension. This technique turned out to be so useful that it got generalized in many different ways, eventually leading to powerful tools that enabled mathematicians to make great progress in cataloging the variety of objects they encountered in their investigations. Unfortunately, the geometric origins of the procedure became obscured in this generalization. In some sense it was necessary to add pieces that did not have any geometric interpretation. The Hodge conjecture asserts that for particularly nice types of spaces called projective algebraic varieties, the pieces called Hodge cycles are actually (rational linear) combinations of geometric pieces called algebraic cycles.",
"rules": "The SAB of CMI will consider a proposed solution to a Millennium Prize Problem if it is a complete mathematical solution to one of the problems. (In the case that someone discovers a mathematical counterexample, rather than a proof, the question will be considered separately as described below.) A proposed solution to one of the Millennium Prize Problems may not be submitted directly to CMI for consideration.\nBefore consideration, a proposed solution must be published in a refereed mathematics publication of worldwide repute (or such other form as the SAB shall determine qualifies), and it must also have general acceptance in the mathematics community two years after. Following this two-year waiting period, the SAB will decide whether a solution merits detailed consideration. In the affirmative case, the SAB will constitute a special advisory committee, which will include (a) at least one SAB member and (b) at least two non-SAB members who are experts in the area of the problem. The SAB will seek advice to determine potential non-SAB members who are internationally-recognized mathematical experts in the area of the problem. As part of this procedure, each component of a proposed solution under consideration shall be verified by one or more members of this special advisory committee. \nThe special advisory committee will report within a reasonable time to the SAB. Based on this report and possible further investigation, the SAB will make a recommendation to the Directors. The SAB may recommend the award of a prize to one person. The SAB may recommend that a particular prize be divided among multiple solvers of a problem or their heirs. The SAB will pay special attention to the question of whether a prize solution depends crucially on insights published prior to the solution under consideration. The SAB may (but need not) recommend recognition of such prior work in the prize citation, and it may (but need not) recommend the inclusion of the author of prior work in the award. \n\nIf the SAB cannot come to a clear decision about the correctness of a solution to a problem, its attribution, or the appropriateness of an award, the SAB may recommend that no prize be awarded for a particular problem. If new information comes to light, the SAB may (but will not necessarily) reconsider a negative decision to recommend a prize for a proposed solution, but only after an additional two-year waiting period following the time that the new information comes to light. The SAB has the sole authority to make recommendations to the Directors of the CMI concerning the appropriateness of any award and the validity of any claim to the CMI Millennium Prize.\n\nIn the case of the P versus NP problem and the Navier-Stokes problem, the SAB will consider the award of the Millennium Prize for deciding the question in either direction. In the case of the other problems if a counterexample is proposed, the SAB will consider this counterexample after publication and the same two-year waiting period as for a proposed solution will apply. If, in the opinion of the SAB, the counterexample effectively resolves the problem then the SAB may recommend the award of the Prize. If the counterexample shows that the original problem survives after reformulation or elimination of some special case, then the SAB may recommend that a small prize be awarded to the author. The money for this prize will not be taken from the Millennium Prize Problem fund, but from other CMI funds.\nAny person who is not a disqualified person (as that term is defined in section 4946 of the Internal Revenue Code) in connection with the Institute, or a then serving member of the SAB, may receive the Millennium Prize. \nAll decision-making procedures concerning the CMI Millennium Prize Problems are private. This includes the deliberations or recommendations of any person or persons CMI has used to obtain advice on this question. No records of these deliberations or related correspondence may be made public without the prior approval of the Directors, the SAB, and all other living persons involved, unless fifty years time have elapsed after the event in question.\nNotwithstanding the wording of the problem descriptions, the SAB will not consider recommending the award of a prize to any individual who has not, in the judgement of SAB, made a major personal contribution to the understanding of the field of the problem in their published solution; nor will it investigate in detail solutions that do not represent a major advance in the field. Conversely, the SAB may consider recommending the award of the prize to an individual who has published work that, in the judgement of the SAB, fully resolves the questions raised by one of the Millennium Prize Problems even if it does not exactly meet the wording in the official problem description. \n\nReference URL: http://www.claymath.org/millennium/Navier-Stokes_Equations/navierstokes.pdf",
"eligibility": "",
"fee": "",
"awards_attributes": [{"value": "$1,000,000", "description": ""}],
"deadlines_attributes": [{"date": "None", "description": ""}],
"post_date": "May, 24th 2000",
"image_url": "http://www.claymath.org/images/sculpture.gif",
"sponsor": "Clay Mathematics Institute",
"contact_info": "Corporate Address: \nClay Mathematics Institute \n10 Memorial Blvd.\nSuite 902\nProvidence, RI 02903\nUSA\n\nPlease send inquiries regarding the Millennium Prize Problems to admin@claymath.org \n\nTelephone: +44 (0)1865 615155\nFax: +44 (0)1865 615101",
"topic": "Math",
"structure": "Until Prize is Claimed \nPublication",
"resultant": "Open Source",
"xpath_check": "http://www.claymath.org/millennium/Navier-Stokes_Equations/html/body/div[4]/div/p \nhttp://www.claymath.org/millennium/Rules_etc/html/body/div[4]/div/p[11]/em"
},{"url": "url: http://www.claymath.org/millennium/P_vs_NP/",
"title": "P versus NP",
"tag_line": "A Millennium Prize Problem",
"summary": "Overview: \nIn order to celebrate mathematics in the new millennium, The Clay Mathematics Institute of Cambridge, Massachusetts (CMI) established seven Prize Problems. The Prizes were conceived to record some of the most difficult problems with which mathematicians were grappling at the turn of the second millennium; to elevate in the consciousness of the general public the fact that in mathematics, the frontier is still open and abounds in important unsolved problems; to emphasize the importance of working towards a solution of the deepest, most difficult problems; and to recognize achievement in mathematics of historical magnitude. \nThe prizes were announced at a meeting in Paris, held on May 24, 2000 at the Collège de France. Three lectures were presented: Timothy Gowers spoke on The Importance of Mathematics; Michael Atiyah and John Tate spoke on the problems themselves. \nThe seven Millennium Prize Problems were chosen by the founding Scientific Advisory Board of CMI, which conferred with leading experts worldwide. The focus of the board was on important classic questions that have resisted solution for many years. \nFollwing the decision of the Scientific Advisory Board, the Board of Directors of CMI designated a $7 million prize fund for the solution to these problems, with $1 million allocated to the solution of each problem. \nIt is of note that one of the seven Millennium Prize Problems, the Riemann hypothesis, formulated in 1859, also appears in the list of twenty-three problem discuss in the address given in Paris by David Hilbert on August 9, 1900. \n\nThe P versus NP Problem: \nSuppose that you are organizing housing accommodations for a group of four hundred university students. Space is limited and only one hundred of the students will receive places in the dormitory. To complicate matters, the Dean has provided you with a list of pairs of incompatible students, and requested that no pair from this list appear in your final choice. This is an example of what computer scientists call an NP-problem, since it is easy to check if a given choice of one hundred students proposed by a coworker is satisfactory (i.e., no pair taken from your coworker's list also appears on the list from the Dean's office), however the task of generating such a list from scratch seems to be so hard as to be completely impractical. Indeed, the total number of ways of choosing one hundred students from the four hundred applicants is greater than the number of atoms in the known universe! Thus no future civilization could ever hope to build a supercomputer capable of solving the problem by brute force; that is, by checking every possible combination of 100 students. However, this apparent difficulty may only reflect the lack of ingenuity of your programmer. In fact, one of the outstanding problems in computer science is determining whether questions exist whose answer can be quickly checked, but which require an impossibly long time to solve by any direct procedure. Problems like the one listed above certainly seem to be of this kind, but so far no one has managed to prove that any of them really are so hard as they appear, i.e., that there really is no feasible way to generate an answer with the help of a computer. Stephen Cook and Leonid Levin formulated the P (i.e., easy to find) versus NP (i.e., easy to check) problem independently in 1971.",
"rules": "The SAB of CMI will consider a proposed solution to a Millennium Prize Problem if it is a complete mathematical solution to one of the problems. (In the case that someone discovers a mathematical counterexample, rather than a proof, the question will be considered separately as described below.) A proposed solution to one of the Millennium Prize Problems may not be submitted directly to CMI for consideration.\nBefore consideration, a proposed solution must be published in a refereed mathematics publication of worldwide repute (or such other form as the SAB shall determine qualifies), and it must also have general acceptance in the mathematics community two years after. Following this two-year waiting period, the SAB will decide whether a solution merits detailed consideration. In the affirmative case, the SAB will constitute a special advisory committee, which will include (a) at least one SAB member and (b) at least two non-SAB members who are experts in the area of the problem. The SAB will seek advice to determine potential non-SAB members who are internationally-recognized mathematical experts in the area of the problem. As part of this procedure, each component of a proposed solution under consideration shall be verified by one or more members of this special advisory committee. \nThe special advisory committee will report within a reasonable time to the SAB. Based on this report and possible further investigation, the SAB will make a recommendation to the Directors. The SAB may recommend the award of a prize to one person. The SAB may recommend that a particular prize be divided among multiple solvers of a problem or their heirs. The SAB will pay special attention to the question of whether a prize solution depends crucially on insights published prior to the solution under consideration. The SAB may (but need not) recommend recognition of such prior work in the prize citation, and it may (but need not) recommend the inclusion of the author of prior work in the award. \n\nIf the SAB cannot come to a clear decision about the correctness of a solution to a problem, its attribution, or the appropriateness of an award, the SAB may recommend that no prize be awarded for a particular problem. If new information comes to light, the SAB may (but will not necessarily) reconsider a negative decision to recommend a prize for a proposed solution, but only after an additional two-year waiting period following the time that the new information comes to light. The SAB has the sole authority to make recommendations to the Directors of the CMI concerning the appropriateness of any award and the validity of any claim to the CMI Millennium Prize.\n\nIn the case of the P versus NP problem and the Navier-Stokes problem, the SAB will consider the award of the Millennium Prize for deciding the question in either direction. In the case of the other problems if a counterexample is proposed, the SAB will consider this counterexample after publication and the same two-year waiting period as for a proposed solution will apply. If, in the opinion of the SAB, the counterexample effectively resolves the problem then the SAB may recommend the award of the Prize. If the counterexample shows that the original problem survives after reformulation or elimination of some special case, then the SAB may recommend that a small prize be awarded to the author. The money for this prize will not be taken from the Millennium Prize Problem fund, but from other CMI funds.\nAny person who is not a disqualified person (as that term is defined in section 4946 of the Internal Revenue Code) in connection with the Institute, or a then serving member of the SAB, may receive the Millennium Prize. \nAll decision-making procedures concerning the CMI Millennium Prize Problems are private. This includes the deliberations or recommendations of any person or persons CMI has used to obtain advice on this question. No records of these deliberations or related correspondence may be made public without the prior approval of the Directors, the SAB, and all other living persons involved, unless fifty years time have elapsed after the event in question.\nNotwithstanding the wording of the problem descriptions, the SAB will not consider recommending the award of a prize to any individual who has not, in the judgement of SAB, made a major personal contribution to the understanding of the field of the problem in their published solution; nor will it investigate in detail solutions that do not represent a major advance in the field. Conversely, the SAB may consider recommending the award of the prize to an individual who has published work that, in the judgement of the SAB, fully resolves the questions raised by one of the Millennium Prize Problems even if it does not exactly meet the wording in the official problem description. \n\nReference URL: http://www.claymath.org/millennium/P_vs_NP/pvsnp.pdf",
"eligibility": "",
"fee": "",
"awards_attributes": [{"value": "$1,000,000", "description": ""}],
"deadlines_attributes": [{"date": "None", "description": ""}],
"post_date": "May, 24th 2000",
"image_url": "http://www.claymath.org/images/sculpture.gif",
"sponsor": "Clay Mathematics Institute",
"contact_info": "Corporate Address: \nClay Mathematics Institute \n10 Memorial Blvd.\nSuite 902\nProvidence, RI 02903\nUSA\n\nPlease send inquiries regarding the Millennium Prize Problems to admin@claymath.org \n\nTelephone: +44 (0)1865 615155\nFax: +44 (0)1865 615101",
"topic": "Math",
"structure": "Until Prize is Claimed \nPublication",
"resultant": "Open Source",
"xpath_check": "http://www.claymath.org/millennium/P_vs_NP/html/body/div[4]/div/p \nhttp://www.claymath.org/millennium/Rules_etc/html/body/div[4]/div/p[11]/em"
},{"url": "http://www.claymath.org/millennium/Riemann_Hypothesis/",
"title": "The Riemann Hypothesis",
"tag_line": "A Millennium Prize Problem",
"summary": "Overview: In order to celebrate mathematics in the new millennium, The Clay Mathematics Institute of Cambridge, Massachusetts (CMI) established seven Prize Problems. The Prizes were conceived to record some of the most difficult problems with which mathematicians were grappling at the turn of the second millennium; to elevate in the consciousness of the general public the fact that in mathematics, the frontier is still open and abounds in important unsolved problems; to emphasize the importance of working towards a solution of the deepest, most difficult problems; and to recognize achievement in mathematics of historical magnitude. \nThe prizes were announced at a meeting in Paris, held on May 24, 2000 at the Collège de France. Three lectures were presented: Timothy Gowers spoke on The Importance of Mathematics; Michael Atiyah and John Tate spoke on the problems themselves. \nThe seven Millennium Prize Problems were chosen by the founding Scientific Advisory Board of CMI, which conferred with leading experts worldwide. The focus of the board was on important classic questions that have resisted solution for many years. \nFollwing the decision of the Scientific Advisory Board, the Board of Directors of CMI designated a $7 million prize fund for the solution to these problems, with $1 million allocated to the solution of each problem. \nIt is of note that one of the seven Millennium Prize Problems, the Riemann hypothesis, formulated in 1859, also appears in the list of twenty-three problem discuss in the address given in Paris by David Hilbert on August 9, 1900. \n\nThe Riemann Hypothesis: \nSome numbers have the special property that they cannot be expressed as the product of two smaller numbers, e.g., 2, 3, 5, 7, etc. Such numbers are called prime numbers, and they play an important role, both in pure mathematics and its applications. The distribution of such prime numbers among all natural numbers does not follow any regular pattern, however the German mathematician G.F.B. Riemann (1826 - 1866) observed that the frequency of prime numbers is very closely related to the behavior of an elaborate function \nζ(s) = 1 + (1/2)^s + (1/3)^s + (1/4)^s + ... \ncalled the Riemann Zeta function. The Riemann hypothesis asserts that all interesting solutions of the equation \n\n ζ(s) = 0\n\nlie on a certain vertical straight line. This has been checked for the first 1,500,000,000 solutions. A proof that it is true for every interesting solution would shed light on many of the mysteries surrounding the distribution of prime numbers.",
"rules": "The SAB of CMI will consider a proposed solution to a Millennium Prize Problem if it is a complete mathematical solution to one of the problems. (In the case that someone discovers a mathematical counterexample, rather than a proof, the question will be considered separately as described below.) A proposed solution to one of the Millennium Prize Problems may not be submitted directly to CMI for consideration.\nBefore consideration, a proposed solution must be published in a refereed mathematics publication of worldwide repute (or such other form as the SAB shall determine qualifies), and it must also have general acceptance in the mathematics community two years after. Following this two-year waiting period, the SAB will decide whether a solution merits detailed consideration. In the affirmative case, the SAB will constitute a special advisory committee, which will include (a) at least one SAB member and (b) at least two non-SAB members who are experts in the area of the problem. The SAB will seek advice to determine potential non-SAB members who are internationally-recognized mathematical experts in the area of the problem. As part of this procedure, each component of a proposed solution under consideration shall be verified by one or more members of this special advisory committee. \nThe special advisory committee will report within a reasonable time to the SAB. Based on this report and possible further investigation, the SAB will make a recommendation to the Directors. The SAB may recommend the award of a prize to one person. The SAB may recommend that a particular prize be divided among multiple solvers of a problem or their heirs. The SAB will pay special attention to the question of whether a prize solution depends crucially on insights published prior to the solution under consideration. The SAB may (but need not) recommend recognition of such prior work in the prize citation, and it may (but need not) recommend the inclusion of the author of prior work in the award. \n\nIf the SAB cannot come to a clear decision about the correctness of a solution to a problem, its attribution, or the appropriateness of an award, the SAB may recommend that no prize be awarded for a particular problem. If new information comes to light, the SAB may (but will not necessarily) reconsider a negative decision to recommend a prize for a proposed solution, but only after an additional two-year waiting period following the time that the new information comes to light. The SAB has the sole authority to make recommendations to the Directors of the CMI concerning the appropriateness of any award and the validity of any claim to the CMI Millennium Prize.\n\nIn the case of the P versus NP problem and the Navier-Stokes problem, the SAB will consider the award of the Millennium Prize for deciding the question in either direction. In the case of the other problems if a counterexample is proposed, the SAB will consider this counterexample after publication and the same two-year waiting period as for a proposed solution will apply. If, in the opinion of the SAB, the counterexample effectively resolves the problem then the SAB may recommend the award of the Prize. If the counterexample shows that the original problem survives after reformulation or elimination of some special case, then the SAB may recommend that a small prize be awarded to the author. The money for this prize will not be taken from the Millennium Prize Problem fund, but from other CMI funds.\nAny person who is not a disqualified person (as that term is defined in section 4946 of the Internal Revenue Code) in connection with the Institute, or a then serving member of the SAB, may receive the Millennium Prize. \nAll decision-making procedures concerning the CMI Millennium Prize Problems are private. This includes the deliberations or recommendations of any person or persons CMI has used to obtain advice on this question. No records of these deliberations or related correspondence may be made public without the prior approval of the Directors, the SAB, and all other living persons involved, unless fifty years time have elapsed after the event in question.\nNotwithstanding the wording of the problem descriptions, the SAB will not consider recommending the award of a prize to any individual who has not, in the judgement of SAB, made a major personal contribution to the understanding of the field of the problem in their published solution; nor will it investigate in detail solutions that do not represent a major advance in the field. Conversely, the SAB may consider recommending the award of the prize to an individual who has published work that, in the judgement of the SAB, fully resolves the questions raised by one of the Millennium Prize Problems even if it does not exactly meet the wording in the official problem description. \n\nReference URLs: http://www.claymath.org/millennium/Riemann_Hypothesis/riemann.pdf \nhttp://www.claymath.org/millennium/Riemann_Hypothesis/Sarnak_RH.pdf \nhttp://claymath.msri.org/riemannhypothesis.mov \nhttp://www.claymath.org/millennium/Riemann_Hypothesis/1859_manuscript/",
"eligibility": "",
"fee": "",
"awards_attributes": [{"value": "$1,000,000", "description": ""}],
"deadlines_attributes": [{"date": "None", "description": ""}],
"post_date": "May, 24th 2000",
"image_url": "http://www.claymath.org/images/sculpture.gif",
"sponsor": "Clay Mathematics Institute",
"contact_info": "Corporate Address: \nClay Mathematics Institute \n10 Memorial Blvd.\nSuite 902\nProvidence, RI 02903\nUSA\n\nPlease send inquiries regarding the Millennium Prize Problems to admin@claymath.org \n\nTelephone: +44 (0)1865 615155\nFax: +44 (0)1865 615101",
"topic": "Math",
"structure": "Until Prize is Claimed \nPublication",
"resultant": "Open Source",
"xpath_check": "http://www.claymath.org/millennium/Riemann_Hypothesis/html/body/div[4]/div/p \nhttp://www.claymath.org/millennium/Rules_etc/html/body/div[4]/div/p[11]/em"
},{"url": "http://www.claymath.org/millennium/Yang-Mills_Theory/",
"title": "The Yang-Mills Theory",
"tag_line": "A Millennium Prize Problem",
"summary": "Overview: \nIn order to celebrate mathematics in the new millennium, The Clay Mathematics Institute of Cambridge, Massachusetts (CMI) established seven Prize Problems. The Prizes were conceived to record some of the most difficult problems with which mathematicians were grappling at the turn of the second millennium; to elevate in the consciousness of the general public the fact that in mathematics, the frontier is still open and abounds in important unsolved problems; to emphasize the importance of working towards a solution of the deepest, most difficult problems; and to recognize achievement in mathematics of historical magnitude. \nThe prizes were announced at a meeting in Paris, held on May 24, 2000 at the Collège de France. Three lectures were presented: Timothy Gowers spoke on The Importance of Mathematics; Michael Atiyah and John Tate spoke on the problems themselves. \nThe seven Millennium Prize Problems were chosen by the founding Scientific Advisory Board of CMI, which conferred with leading experts worldwide. The focus of the board was on important classic questions that have resisted solution for many years. \nFollwing the decision of the Scientific Advisory Board, the Board of Directors of CMI designated a $7 million prize fund for the solution to these problems, with $1 million allocated to the solution of each problem. \nIt is of note that one of the seven Millennium Prize Problems, the Riemann hypothesis, formulated in 1859, also appears in the list of twenty-three problem discuss in the address given in Paris by David Hilbert on August 9, 1900. \n\nThe Yang-Mills Theory: \nThe laws of quantum physics stand to the world of elementary particles in the way that Newton's laws of classical mechanics stand to the macroscopic world. Almost half a century ago, Yang and Mills introduced a remarkable new framework to describe elementary particles using structures that also occur in geometry. Quantum Yang-Mills theory is now the foundation of most of elementary particle theory, and its predictions have been tested at many experimental laboratories, but its mathematical foundation is still unclear. The successful use of Yang-Mills theory to describe the strong interactions of elementary particles depends on a subtle quantum mechanical property called the mass gap: the quantum particles have positive masses, even though the classical waves travel at the speed of light. This property has been discovered by physicists from experiment and confirmed by computer simulations, but it still has not been understood from a theoretical point of view. Progress in establishing the existence of the Yang-Mills theory and a mass gap and will require the introduction of fundamental new ideas both in physics and in mathematics.",
"rules": "The SAB of CMI will consider a proposed solution to a Millennium Prize Problem if it is a complete mathematical solution to one of the problems. (In the case that someone discovers a mathematical counterexample, rather than a proof, the question will be considered separately as described below.) A proposed solution to one of the Millennium Prize Problems may not be submitted directly to CMI for consideration.\nBefore consideration, a proposed solution must be published in a refereed mathematics publication of worldwide repute (or such other form as the SAB shall determine qualifies), and it must also have general acceptance in the mathematics community two years after. Following this two-year waiting period, the SAB will decide whether a solution merits detailed consideration. In the affirmative case, the SAB will constitute a special advisory committee, which will include (a) at least one SAB member and (b) at least two non-SAB members who are experts in the area of the problem. The SAB will seek advice to determine potential non-SAB members who are internationally-recognized mathematical experts in the area of the problem. As part of this procedure, each component of a proposed solution under consideration shall be verified by one or more members of this special advisory committee. \nThe special advisory committee will report within a reasonable time to the SAB. Based on this report and possible further investigation, the SAB will make a recommendation to the Directors. The SAB may recommend the award of a prize to one person. The SAB may recommend that a particular prize be divided among multiple solvers of a problem or their heirs. The SAB will pay special attention to the question of whether a prize solution depends crucially on insights published prior to the solution under consideration. The SAB may (but need not) recommend recognition of such prior work in the prize citation, and it may (but need not) recommend the inclusion of the author of prior work in the award. \n\nIf the SAB cannot come to a clear decision about the correctness of a solution to a problem, its attribution, or the appropriateness of an award, the SAB may recommend that no prize be awarded for a particular problem. If new information comes to light, the SAB may (but will not necessarily) reconsider a negative decision to recommend a prize for a proposed solution, but only after an additional two-year waiting period following the time that the new information comes to light. The SAB has the sole authority to make recommendations to the Directors of the CMI concerning the appropriateness of any award and the validity of any claim to the CMI Millennium Prize.\n\nIn the case of the P versus NP problem and the Navier-Stokes problem, the SAB will consider the award of the Millennium Prize for deciding the question in either direction. In the case of the other problems if a counterexample is proposed, the SAB will consider this counterexample after publication and the same two-year waiting period as for a proposed solution will apply. If, in the opinion of the SAB, the counterexample effectively resolves the problem then the SAB may recommend the award of the Prize. If the counterexample shows that the original problem survives after reformulation or elimination of some special case, then the SAB may recommend that a small prize be awarded to the author. The money for this prize will not be taken from the Millennium Prize Problem fund, but from other CMI funds.\nAny person who is not a disqualified person (as that term is defined in section 4946 of the Internal Revenue Code) in connection with the Institute, or a then serving member of the SAB, may receive the Millennium Prize. \nAll decision-making procedures concerning the CMI Millennium Prize Problems are private. This includes the deliberations or recommendations of any person or persons CMI has used to obtain advice on this question. No records of these deliberations or related correspondence may be made public without the prior approval of the Directors, the SAB, and all other living persons involved, unless fifty years time have elapsed after the event in question.\nNotwithstanding the wording of the problem descriptions, the SAB will not consider recommending the award of a prize to any individual who has not, in the judgement of SAB, made a major personal contribution to the understanding of the field of the problem in their published solution; nor will it investigate in detail solutions that do not represent a major advance in the field. Conversely, the SAB may consider recommending the award of the prize to an individual who has published work that, in the judgement of the SAB, fully resolves the questions raised by one of the Millennium Prize Problems even if it does not exactly meet the wording in the official problem description. \n\nReference URL: http://www.claymath.org/millennium/Yang-Mills_Theory/yangmills.pdf\nhttp://www.claymath.org/millennium/Yang-Mills_Theory/ym2.pdf \nhttp://claymath.msri.org/yangmillsexistence.mov",
"eligibility": "",
"fee": "",
"awards_attributes": [{"value": "$1,000,000", "description": ""}],
"deadlines_attributes": [{"date": "None", "description": ""}],
"post_date": "May, 24th 2000",
"image_url": "http://www.claymath.org/images/sculpture.gif",
"sponsor": "Clay Mathematics Institute",
"contact_info": "Corporate Address: \nClay Mathematics Institute \n10 Memorial Blvd.\nSuite 902\nProvidence, RI 02903\nUSA\n\nPlease send inquiries regarding the Millennium Prize Problems to admin@claymath.org \n\nTelephone: +44 (0)1865 615155\nFax: +44 (0)1865 615101",
"topic": "Math",
"structure": "Until Prize is Claimed \nPublication",
"resultant": "Open Source",
"xpath_check": "http://www.claymath.org/millennium/Yang-Mills_Theory/html/body/div[4]/div[2]/img \nhttp://www.claymath.org/millennium/Rules_etc/html/body/div[4]/div/p[11]/em"
},{"url": "http://prize.hutter1.net/",
"title": "The Hutter Prize",
"tag_line": "Prize for Compressing Human Knowledge",
"summary": "Being able to compress well is closely related to intelligence as explained below. While intelligence is a slippery concept, file sizes are hard numbers. Wikipedia is an extensive snapshot of Human Knowledge. If you can compress the first 100MB of Wikipedia better than your predecessors, your (de)compressor likely has to be smart(er). The intention of this prize is to encourage development of intelligent compressors/programs as a path to AGI. \nThe Hutter Prize is a cash prize funded by Marcus Hutter which rewards data compression improvements on a specific 100 MB English text file. Specifically, the prize awards 500 euros for each one percent improvement (with 50,000 euros total funding) in the compressed size of the file enwik8, which is the smaller of two files used in the Large Text Compression Benchmark; enwik8 is the first 100,000,000 characters of a specific version of English Wikipedia. \nThe goal of the Hutter Prize is to encourage research in artificial intelligence (AI). The organizers believe that text compression and AI are equivalent problems. Hutter proved that the optimal behavior of a goal seeking agent in an unknown but computable environment is to guess at each step that the environment is probably controlled by one of the shortest programs consistent with all interaction so far. Unfortunately, there is no general solution because Kolmogorov complexity is not computable. Hutter proved that in the restricted case (called AIXItl) where the environment is restricted to time t and space l, that a solution can be computed in time O(t2l), which is still intractable. \nThe organizers further believe that compressing natural language text is a hard AI problem, equivalent to passing the Turing test. Thus, progress toward one goal represents progress toward the other. They argue that predicting which characters are most likely to occur next in a text sequence requires vast real-world knowledge. A text compressor must solve the same problem in order to assign the shortest codes to the most likely text sequences.",
"rules": "To enter, a competitor must submit a compression program and a decompressor that decompresses to the file enwik8.[2] It is also possible to submit a compressed file instead of the compression program. The total size of the compressed file and decompressor (as a Win32 or Linux executable) must not be larger than 99% of the previous prize winning entry. For each one percent improvement, the competitor wins 500 euros. The decompression program must also meet execution time and memory constraints, currently 10 hours on a 2 GHz Pentium 4 with 1 GB memory. These constraints may be relaxed in the future.\n\nSubmissions must be published in order to allow independent verification. There is a 30 day waiting period for public comment before awarding a prize. The rules do not require the release of source code, unless such release is required by the code's license (as in the case of PAQ, which is licensed under GPL). \n\nRelaxations:\nIn lieu of a self-extracting archive, a decompressor program decomp8.exe plus a compressed file archive8.bhm may be published, where decomp8.exe produces data8 from archive8.bhm. In this case, the total size is S := length(decomp8.exe)+length(archive8.bhm).\nIn lieu of archive8, a compressor comp8.exe may be published, together with the size of archive8 (and possible options used to create it), which creates archive8 from enwik8.\nResource restrictions for the (de)compressor are the same as for the self-extracting archive.\nThe used filenames (except enwik8) are just for illustration.\nIf your contribution violates some of the rules, you may still be eligible for the Large Compression Benchmark (see below).\n\nAny additional information, even if not complete, especially on the inner workings of the (de)compressor, the source code, etc, is highly appreciated.\n\nParticipation:\nAnyone may participate at this contest by emailing the following information to matmahoney@yahoo.com:\n\nName of program(s), version, and used options.\nSize of compressed enwik8, i.e. of archive8.exe or decomp8.exe+archive8.bhm.\nApproximate (de)compression time and memory used.\nDescription of the test machine (processor, memory, operating system).\nLinks where files can be downloaded.\n\nMore Information:\nCompressors/decompressors do not have to be general purpose. They may be tuned specifically to this benchmark and are allowed to reject or fail on any input other than enwik8/archive8.bhm.\nOnly the version and combination of options submitted is eligible for the prize.\nIf an author breaks his own record within 30 days, the older submission is regarded as withdrawn.\nIf a submission fails to meet the criteria for the prize, the entrant will be informed, and the submission henceforth be ignored. In particular a miss of the 3% criterion will not diminish the prize (L remains unchanged).\nIf your compressor beats the current record, but violates some of the constraints regarding operating system, used dll's, used programming language, etc, Matt Mahoney may be willing to assist you in satisfying them. For instance if you send portable C code he can compile it under Windows for you.\nYou can run some of the previous records on your system, and by comparing your runtime with the displayed runtime, you can estimate whether your algorithm will meet the time constraint on our machine.\nMembers of the prize committee are not eligible for prize money. If a committee member publishes a (de)compressor that would have otherwise won prize money, then L is updated as in the normal case, but no money is paid.\nThe above formula currently amounts to 1€ for every 330 byte improvement, with a minimum improvement of 494'449 bytes.\nIf a decompressor has multiple authors, then a submission must include instructions for dividing the prize money. All authors must agree on this distribution before any money can be awarded.\nThere will be a waiting period of at least 30 days after submission to allow for public comment and verification. Comments should be made to the Hutter Prize Newsgroup or by email to members of the Prize committee.\nThe programs and/or data files must be available on the Internet for free download and testing.\nThe (virtual) prize fund (Z) is constant. It is not decreased after awarding a prize. It may increase if additional sponsors contribute to it. (Please contact Marcus Hutter if you wish to contribute).\nThe prize will be paid if the solution reflects the spirit of the contest. In particular decompressors (secretely) receiving any kind of 'outside' information are forbidden. Also in order to verify your claim we need to be able to run your executable on our machines. Payment of the prize cannot be legally enforced. Marcus Hutter will make the final decision whether to recognize a record, award a prize, and the amount.\nRules may change at any time without notice to meet the goals of fairness, accuracy, maximizing public participation, and recognizing existing practice.\nThese rules are intensifications of Matt Mahoney's Large Compression Benchmark rules.",
"eligibility": "The contest is open ended. It is open to everyone.",
"fee": "",
"awards_attributes": [{"value": "Variable (see description)", "description": "The prize is awarded as follows:\n\nAward = Z×(L-S)/L, where \nS = new record (size of archive8.exe or decomp8.exe+archive8.bhm+opt), \nL = previous record for S, \nZ = amount in prize fund (currently 50'000€) \nUpdate: L := S. \nMinimum award is 3% of Z. \nContributions are dealt with in the order of their submission. \nThe contribution is subject to public comments for a period of at least 30 days before the prize is awarded."}],
"deadlines_attributes": [{"date": "None", "description": ""}],
"post_date": "August 6th, 2006",
"image_url": "http://prize.hutter1.net/hmedal.gif",
"sponsor": "Marcus Hutter",
"contact_info": "Matt Mahoney:  matmahoney@yahoo.com \n\nTo Post Questions: \nhttps://groups.google.com/group/Hutter-Prize/about/",
"topic": "Math\nComputer Science\nArticfitial Intelligence",
"structure": "Until Prize is Claimed \nContinuous Record Breaking ",
"resultant": "Open Source",
"xpath_check": "http://en.wikipedia.org/wiki/Hutter_Prize/html/body/div[3]/div[3]/div[4]/p/b\nhttp://prize.hutter1.net/#task/html/body/center[4]/table/tbody/tr[2]/td[2]"

},{"url": "http://www.qualcommtricorderxprize.org/",
"title": "QUALCOMM Tricorder Xprize",
"tag_line": "Healthcare in the palm of your hand",
"summary": "The Qualcomm Tricorder XPRIZE is a $10 million global competition to stimulate innovation and integration of precision diagnostic technologies, making reliable health diagnoses available directly to 'health consumers' in their homes.\n\nThe dire need for improvements in health and healthcare in the U.S. has captured the attention of government, industry, and private citizens for years. But a viable solution has yet evaded one of the most technologically advanced, educated and prosperous nations on the globe. Integrated diagnostic technology, once available on a consumer mobile device that is easy to use, will allow individuals to incorporate health knowledge and decision-making into their daily lives.\n\nAdvances in fields such as artificial intelligence, wireless sensing, imaging diagnostics, lab-on-a-chip, and molecular biology will enable better choices in when, where, and how individuals receive care, thus making healthcare more convenient, affordable, and accessible. The winner will be the team whose technology most accurately diagnoses a set of diseases independent of a healthcare professional or facility, and that provides the best consumer user experience with their device.",
"rules": "The Qualcomm Tricorder XPRIZE is an incentivized competition open for approximately 3.5 years. Teams must advance through a Qualifying Round and a Final Round of judging. Up to three teams will be awarded a prize in the Final Round.\nFinalist teams will compete in both a diagnostic and consumer experience evaluation during the Final Round. The Final Round evaluation will occur in the United States, although the competition is open to teams from around the world. Teams will be expected to meet baseline standards of accuracy and functionality, but the winning entries will be the ones that score the highest in the diagnostic contest. To emphasize the importance of consumer use and adoption, only the five highest scoring teams from the consumer experience evaluation will be eligible to win.\n\nThe winners will be the (up to) three solutions achieving the highest diagnostic score regarding a set of 15 distinct diseases in a group of 15-30 people in three days (see Guidelines for full details). This diagnosis must be performed in the hands of a consumer, independently of a healthcare worker or facility.\n\nQualifying Round\n\nWhile precise dates are still being finalized, the following provides a general view of the competition schedule. The Qualifying Round will take place approximately 27-28 months after the January 2012 prize launch. From the Qualifying Round, 10 teams will advance based on:\n\n(a) a controlled demonstration of sensor validity; and\n(b) an evaluation of supporting studies, multimedia, and prototypes.\nFinal Round\n\nThe Final Round is scheduled to occur approximately 39-40 months after the prize launch. The Final Round competition will include:\n(a) a diagnostic competition on 15-30 consumers per team;\n(b) a concurrent consumer experience evaluation; and\n(c) proof of adequate high-frequency data logging.\nTeams advancing to the Final Round will compete in both the diagnostic and consumer experience evaluation portions of the competition.\nMore Information:  http://www.qualcommtricorderxprize.org/files/qtxp.org/Qualcomm_Tricorder_XPRIZE_Guidelines_20130329.pdf",
"eligibility": "Subject to the below, teams from all countries and with any background who are eligible entities are eligible to compete in the Competition, including, but not limited to, small or large companies, not-for-profit foundations, and teams comprised of students and/or faculty from universities, colleges, or other academic institutions.\n\nTo be eligible to compete and claim any prize, a team must be an eligible entity, which means a legal entity: (i) validly existing, duly organized, and in good standing in the jurisdiction of its organization; (ii) to whom payments may be legally made from the United States in United States Dollars; (iii) organized in a jurisdiction in which the Competition is not prohibited by law; (iv) with a bank account into which funds can legally be deposited from the United States in United States Dollars; and (iv) with insurance, self-insurance, or other risk management means as required by applicable law and determined by the X PRIZE Foundation, in its sole discretion, to be adequate to protect against potential claims, losses, and damages arising from the team’s participation in the Competition. Teams with any team members who are nationals or residents of countries and entities restricted by US export controls and sanctions programs are not eligible to participate in this Competition.",
"fee": "Registration Fee for teams that register between 8 January 2013 and 11:59 a.m. PT, 21 June 2013: $5,000\nRegistration Fee for teams that register between noon PT 21 June 2013 and 11:59 a.m. PT, 1 August 2013: $10,000\nRegistration Fee for teams that register between noon PT 1 August 2013 and 11:59 a.m. PT, 30 August 2013: $25,000",
"awards_attributes": [{"value": "$10,000,000", "description": "The prize is awarded as follows:\n\nAward = Z×(L-S)/L, where \nS = new record (size of archive8.exe or decomp8.exe+archive8.bhm+opt), \nL = previous record for S, \nZ = amount in prize fund (currently 50'000€) \nUpdate: L := S. \nMinimum award is 3% of Z. \nContributions are dealt with in the order of their submission. \nThe contribution is subject to public comments for a period of at least 30 days before the prize is awarded."}],
"deadlines_attributes": [{"date": "Friday, August 30, 2013", "description": "Registration Deadline"},{"date": "April, 2014", "description": "Submissions Deadline"}],
"post_date": "January 2012",
"image_url": "http://www.xprize.org/sites/xprize.org/files/logo.png",
"sponsor": "The XPRIZE Foundation",
"contact_info": "XPRIZE Foundation\n5510 Lincoln Blvd. Suite 100\nPlaya Vista, CA 90094-2034\nU.S.A\n\nTelephone: 310-741-4880\n\nQuestion Submission: http://www.qualcommtricorderxprize.org/about/contact-us\n\nPlease contact Vivan Cabral at 310-751-1434, with questions or comments regarding team registration.",
"topic": "App\nSoftware",
"structure": "Rounds",
"resultant": "Teams Retain IP\nFurthering Science",
"xpath_check": "http://www.qualcommtricorderxprize.org/competition-details/faqs/html/body/div[3]/section/div/div/div/div/div/div/div/article/div/div/div/div/ul[2]"
},{"url": "http://www.nokiasensingxchallenge.org/",
"title": "The Nokia Sensing XCHALLENGE: Competition #2",
"tag_line": "Making Sense of Your Health",
"summary": "Envision a future where everyone has access to affordable, personalized healthcare through sophisticated sensing technologies that put you in charge of your own health. Where sensors and devices recognize and measure your personal health information, provide insights and recommendations relevant to you and communicate that information to your physician. That’s the aim of this competition: a whole new level of personalized, digital health information.",
"rules": "Teams may submit sensing technology developed for any of the principal medical sensing domains, including:\n\nBIOSENSORS\nDomain Definition: Any device that uses specific biochemical reactions to detect chemical compounds in biological samples for the purpose of detecting or measuring a specific disease state or health condition.\nExamples of Sensors: Lab-on-a-chip, polymerase chain reaction (PCR), non-invasive blood sensing, salivary diagnostics, Circulating Nucleic Acids (CAN) and DNA analytics.\n\nIMAGING\nDomain Definition: Physiological imaging that incorporates radiology, nuclear medicine, investigative radiological methods, ultrasound, endoscopy, (medical) thermography, medical photography, and microscopy.\nExamples of Sensors: Magnetic resonance imaging (MRI), computed tomography (CT) and positron Emission tomography (PET) scanning, Ultrasound imaging.\n\nENVIRONMENTAL\nDomain Definition: Detection and characterization of the world outside of the human organism, including pollution, water or airborne allergens, and UV light intensity among other conditions relevant to human health.\nExamples of Sensors: Sensors that detect biological pathogens, chemical or allergenic agents including the presence of food-borne pathogens. Detection of hazardous radiation levels.\n\nKINEMATICS\nDomain Definitiion: Measurement of human movement through space; absolute geographic position, velocity, and acceleration for the purpose of identifying the health status and function of individuals.\nExample of Sensors: Inertial measurement units (IMU) involving any level of biomechanics, motion tracking, orientation, or activity classification to indicate relative health and wellness.\n\nBEHAVIORAL\nDomain Definition: Measurement of data describing mood and emotion with sensors that offer greater accuracy, reliability and frequency than is currently feasible with self-reporting and surveys.\nExample of Sensors: Voice recognition, facial patterns, motion detection, sweat. Can include galvanic, auditory, visual, and behavioral clues about human mood and emotion.\n\nPHYSIOLOGY\nDomain Definition: The quantitative measurement and visualization of physiological states including vital signs, traditional and non-traditional measures of health.\nExample of Sensoes: Electrocardiography (ECG), electroencephalography (EEG), electromyography (EMG), body temperature, levels of relative consciousness and related.\n\nMore Information:\nhttp://www.nokiasensingxchallenge.org/files/nokiasensingxchallenge.org/XPF_NSXC_Guidelines-v5.pdf\nhttp://www.nokiasensingxchallenge.org/files/nokiasensingxchallenge.org/XPF_NSXC_Submission_and_Testing_Procedures-v4.pdf",
"eligibility": "To be eligible to compete and claim any prize, a team must be an Eligible Entity, as defined in the Master Team Agreement (MTA), and must otherwise comply with all the terms of the MTA. The MTA also contains a number of restrictions on the potential entrants that are intended to prevent conflicts of interest. Potential teams are also subject to these restrictions. Current employees of Nokia or any of its group of companies may neither participate in nor have financial interest in any team. The Competition is void in those countries where prohibited or restricted by law.",
"fee": "The registration fee is US $1,000 per entry for each competition, payable in U.S. Dollars only.",
"awards_attributes": [{"value": "$525,000", "description": "A Grand Prize"},{"value": "$120,000", "description": "Up to five Distinguished Awards"}],
"deadlines_attributes": [{"date": "February 10, 2014 11:59 AM PST", "description": "Registration Deadline"},{"date": "April, 2014", "description": "Submissions Deadline"}],
"post_date": "May 24, 2012",
"image_url": "http://www.xprize.org/sites/xprize.org/files/logo.png",
"sponsor": "The XPRIZE Foundation",
"contact_info": "XPRIZE Foundation\n5510 Lincoln Blvd. Suite 100\nPlaya Vista, CA 90094-2034\nU.S.A\n\nTelephone: 310-741-4880\n\nQuestion Submission: http://www.qualcommtricorderxprize.org/about/contact-us\n\nPlease contact Vivan Cabral at 310-751-1434, with questions or comments regarding team registration.",
"topic": "App\nSoftware",
"structure": "Rounds \nTiered",
"resultant": "Teams Retain IP\nFurthering Science",
"xpath_check": "http://www.nokiasensingxchallenge.org/competition-details/faqs/html/body/div[3]/section/div/div/div/div/div/div/div/article/div/div/div/div/ul[2]"
},{"url": "http://www.nightrover.org/",
"title": "The Night Rover Challenge",
"tag_line": "An innovative energy storage competition with $1.5 Million in prizes from NASA",
"summary": "The Night Rover Challenge is the latest in a successful series of Centennial Challenge competitions\nfrom NASA's Office of the Chief Technologist. Learn more about the Centennial Challenges program at www.nasa.gov/challenges\n\nThe Challenge:\nCreate an energy storage system that can allow a simulated rover to remain operational throughout the 14-day-long lunar night.",
"rules": "Restrictions/n– 100kg maximum\n– 2m x 1m x 1m maximum dimensions\n– Must not use any materials or systems that won't be available or function in a space.\nRequirements\n– Store and deliver enough energy to provide an average of 85W continuously throughout\ntwo lunar cycles (starting from the first lunar noon).\n– Provide a minimum of 30.09 kWh over each lunar night cycle.\n– Maximize Watt-Hours / Kilogram, Watt-Hours / Liter, and total energy storage capacity.\n\nTrials\nSystems will be tested through 2 lunar cycles (~2 months) at ambient temperature and pressure\nconditions. NASA's Plumbrook Station in Sandusky, Ohio will host the trials.\n\nJudging\nTo be eligible systems MUST meet the power load requirements averaging 85W throughout the lunar\nnight (354 hours). Systems will be scored on a combination of three weighted criteria: mass (60%),\nvolume (20%), total capacity (20%). Mass is scored on how many kg less than the 100kg restriction,\nvolume is scored on how many liters less than the 2 cubic meter restriction, and capacity is scored on\nhow the total number of Watt-hours provided before the system is exhausted.\n\nTechnical Summary: http://www.nightrover.org/sites/all/themes/theme621/pdf/Technical-Summary.pdf\nRule Specifics: http://www.nightrover.org/sites/all/themes/theme621/pdf/2014_NightRover_Rules-FINAL.pdf",
"eligibility": "Team eligibility requirements are described in the Team Agreement. If teams meet the eligibility\nrequirements in the Team Agreement, they must also complete these milestones to participate in\nthe competition trials:\n1. Receive a favorable review on the registration packet.\n2. Receive a favorable review on the compliance review prior to the trial.",
"fee": "Competition Fee: $3,000 for Early registration, $5,000 for Regular Registration",
"awards_attributes": [{"value": "$500,000", "description": "First Place - Level 1: Greater than 300 Watt-hr/kg"},{"value": "$100,000", "description": "Second Place - Level 1: Greater than 300 Watt-hr/kg"},{"value": "$50,000", "description": "Third Place - Level 1: Greater than 300 Watt-hr/kg"},{"value": "$750,000", "description": "First Place - Level 2: Greater than 400 Watt-hr/kg"},{"value": "$200,000", "description": "Second Place - Level 2: Greater than 400 Watt-hr/kg"},{"value": "$100,000", "description": "Third Place - Level 2: Greater than 400 Watt-hr/kg"},{"value": "$1,000,000", "description": "First Place - Level 3: Greater than 500 Watt-hr/kg"},{"value": "$300,000", "description": "Second Place - Level 3: Greater than 500 Watt-hr/kg"},{"value": "$200,000", "description": "Third Place - Level 3: Greater than 500 Watt-hr/kg"}],
"deadlines_attributes": [{"date": "October 25, 2013 Midnight PST", "description": "Regular Registration Closes"},{"date": "January 20, 2014", "description": "Energy Systems Delivered to Phase 1 Trials (see site for additional dates)"}],
"post_date": "February, 2013",
"image_url": "http://www.nightrover.org/sites/default/files/logo.png",
"sponsor": "NASA",
"contact_info": "http://www.nightrover.org/contactus\n88 King Street #406\nSan Francisco, CA 94107\n\njosh@nightrover.org",
"topic": "Science \nTechnology \nSpace",
"structure": "Tiered",
"resultant": "Furthering Technology",
"xpath_check": "http://www.nightrover.org/sites/all/themes/theme621/pdf/2014_NightRover_Rules-FINAL.pdf \nhttp://www.nightrover.org/sites/all/themes/theme621/pdf/Technical-Summary.pdf"
},{"url": "http://connectedcitydesign.com/",
"title": "The Connected City: Open Design Challenge",
"tag_line": "An open call for urban design strategies to connect Downtown Dallas and the Trinity River.",
"summary": "The Connected City Design Challenge will build awareness of urban design solutions capable of shaping Dallas forward, develop a more refined and specific strategy for connecting our downtown and river, and assist in securing future public and private investment. By empowering both designers and citizens, this challenge will realize integrated solutions that improve the city's livability and viability.",
"rules": "STEP ONE:\nProfessionals, non-professionals, and students are asked to register and submit their ideas and solutions for connecting Downtown Dallas and the Trinity River.\n\nSTEP TWO:\nSubmissions will be exhibited and evaluated by the public. Through voting, the public will acknowledge their favorite designs.\n\nSTEP THREE:\nThe jury will select four finalists with each awarded a prize. The four selected designs will be presented as part of a public lecture series.\n\n\nEVALUATION CRITERIA:\nThe following statements of interest reflect the principles on which the The Connected City Design Challenge is crafted. All urban design proposals should work to advance current thinking in the following areas, or convincingly argue for alternatives to be considered while demonstrating a clear understanding of the opportunities and barriers involved.\n\nPLACE - legible + unique\nOften considered as leftover or an ambiguous part of the City, this challenge seeks to redefine the area in a way that transforms it into a vibrant place and destination in and of itself. This sense of place might be developed through buildings, landscape, urban infrastructure, significant public art, great streets or new unidentified approaches. This place should embody qualities that set it apart, creating public spaces that are beautiful, contextual, enlivening and accessible to all citizens.\n\nLINKAGES - movement + mobility:\nThis portion of the City is home to transportation infrastructure that is important for the vitality of the region. However this same infrastructure creates barriers for other types of movement within the area, especially from downtown to the Trinity river. Proposed ideas should reflect the need to maintain the highway and rail linkages while examining and discovering ways to accommodate other movements with an emphasis on walking, cycling and transit.\n\nINNOVATION - inspired + thoughtful:\nThe infrastructure existing today presents an opportunity for innovative and precedent setting strategies for connecting the city. Inspired and creative schemes are encouraged to rethink how development can create a meaningful and real pedestrian place that can elegantly and humanely coexist with modern transportation and storm infrastructure.\n\nNEIGHBORHOODS - respect + enhance:\nThe project area includes or is adjacent to several existing neighborhoods including the Dallas Design District, the West End Historic District, Reunion/Union Station District, Dallas Civic Center, Southside, and the Cedars. Due to the existing transportation infrastructure, and the Trinity Levees, connectivity and integration between these neighborhoods and the river is often challenged. Successful schemes will respect the presence and nature of these neighborhoods while suggesting ways of making public spaces and amenities that are accessible to citizens of all backgrounds, incomes, and abilities.\n\nFor more details, please register at the challenge website.\n\nhttp://www.connectedcitydesign.com/files/content/565958267937326.pdf",
"eligibility": "This category is open to all professionals, non-professionals, and students from the design community. We challenge designers to boldly explore ways of connecting Downtown and the Trinity River and submit their ideas for consideration and public benefit.",
"fee": "",
"awards_attributes": [{"value": "$5,000", "description": "The jury will select four finalists and each will be awarded a $5,000 prize. The four selected designs will be presented as part of a public lecture series."}],
"deadlines_attributes": [{"date": "October 3, 2013", "description": "Open Stream Design Proposals Due"},{"date": "October 17, 2013", "description": "Opening of The Challenge Exhibition (see site for additional dates)"}],
"post_date": "April 4, 2013",
"image_url": "http://connectedcitydesign.com/img/fork.png",
"sponsor": "The City of Dallas, Dallas CityDesign Studio, The Trinity Trust Foundation, Downtown Dallas Inc., and The Real Estate Council Foundation.",
"contact_info": "For questions, please contact: citydesign@connectedcitydesign.com",
"topic": "Design \nArchitecture \nUrban Landscaping",
"structure": "Public voting",
"resultant": "Public Infrastructure",
"xpath_check": "http://www.connectedcitydesign.com/files/content/565958267937326.pdf"
}]