[{"url": "http://arimaa.com/arimaa/challenge/",
"title": "The Arimaa Challenge",
"tag_line": "The first person, company or organization that develops a program which can defeat the top human Arimaa players in an official Arimaa challenge match before the year 2020 will win the Arimaa challenge prize.",
"summary": "In fact we are offering a prize of at least $10,000 USD (current prize may be more) until 2020 to the first person, company or organization who develops a program that can defeat three selected human players in an official Arimaa match. The match will consist of at least 3 games against each of the three players. The program must be able to run on a general-purpose, off-the-shelf computer and not require any specialized hardware.\n    We invite participants from Universities, Corporations and also individuals around the world to see if they can develop the best Arimaa playing program. Each January a tournament will be held to determine the best Arimaa playing program. The winner of that tournament will receive a prize and a chance to try for the $10,000 grand challenge of defeating human players. We especially would like to encourage teams from Universities around the world to participate. The contest will be fun and interesting.\n Arimaa demonstrates that when it comes to serious game playing, humans still dominate. By offering this challenge we hope to increase the awareness that the difficult problem of teaching computers to play strategy games has not yet been tackled. There is much work that needs to be done in understanding how humans play strategy games and producing similar capability in software. We hope this challenge will spur some new and radically different ways of replicating this astonishing human capability in software. The breakthroughs that will come from such research can have significant applications in a wide variety of fields.",
"rules": "Object of the Game\n    Be the first to get one of your rabbits to the other side of the board.\n    Material\n    Arimaa is designed so that it can easily be played using a standard chess set. To make the game easier to learn for someone who is not familiar with chess, the chess pieces are substituted with well known animals. The substitution is as follows: elephant for king, camel for queen, horse for rook, dog for bishop, cat for knight and rabbit for pawn. The elephant is the strongest followed by camel, horse, dog, cat and rabbit. Coins need to placed on squares c3, f3, c6 and f6 of the chess board to mark these as special trap squares (explained later).\n    Setup\n    The game starts with an empty board. The player with the gold pieces sets them on the first two rows closest to that player. There is no fixed starting position so the pieces may be placed in any arrangement. But it is suggested that most of the stronger pieces be placed in front of the weaker rabbits. Once the gold player has finished the silver player sets the pieces on the two closest rows. Again the pieces may be placed in any arrangement within the first two rows.\n    Play\n    The players take turns moving their pieces with the gold player going first. All pieces move the same way: in orthogonal directions (like rooks in chess) forward, backward, left and right. But the rabbits cannot move backward (like pawns in chess). On each turn a player can move the pieces a total of four steps. Moving one piece from its current square to the next adjacent square counts as one step. A piece can take multiple steps and also change directions after each step. The steps may be distributed among multiple pieces so that up to four pieces can be moved. A player may pass some of the steps, but may not pass the whole turn or make a move equivalent to passing the whole turn.\n    The stronger pieces can move opponent's weaker pieces. For example your dog can move the opponent's cat or rabbit, but not the opponent's dog or any other piece that is stronger than it. The opponent's piece must be orthogonally adjacent to your piece and can be moved by either pushing or pulling it. To push an opponent's piece with your stronger piece, first move the opponent's piece to one of the empty orthogonally adjacent squares and then move your piece into its place. To pull an opponent's piece with your stronger piece, first move your piece to one of the unoccupied adjacent squares and then move the opponent's piece into the square that was just vacated. Although rabbits cannot move backwards on their own, they may be pushed or pulled back. A push or pull requires two consecutive steps and must be completed within the same turn. Any combination of pushing and pulling can be done in the same turn. However when your stronger piece is completing a push it cannot pull an opponent's weaker piece along with it.\n    A stronger piece can also freeze any opponent's piece that is weaker than it. A piece which is next to an opponent's stronger piece is considered to be frozen and cannot move on its own; though it can be pushed or pulled by opponents stronger pieces. However if there is a friendly piece next to it the piece is unfrozen and is free to move.\n    There are four distinctly marked traps squares on the board (c3, f3, c6 and f6 in standard notation). Any piece that is on a trap square is immediately removed from the game unless there is a friendly piece next to the trap square to keep it safe. Be careful not to lose your own pieces in the traps.\n    Special Situations\n    A push or pull is considered atomic as if the two pieces are moved simultaneously. Thus it is possible for the pulling piece to step into a trap and be removed from the game while completing the pull.\n    A player may push or pull the opponent's rabbit into the goal row it is trying to reach. If at the end of the turn the rabbit remains there, the player loses. However if the opponent's rabbit is moved back out of the goal row before the end of the turn, the player does not lose.\n    If a player is unable to make a move because all the pieces are frozen or have no place to move, then that player has lost the game.\n    If after a turn the same board position and side to move would occur for the third time, then that move is illegal and the player must select a different move. If in the rare case the only moves a player has are not allowed then the player loses due to being unable to make a move.\n    If a player loses all the rabbits then that player loses the game. If in the rare case both players lose all rabbits on the same move then the player making the move wins the game.\n    Notes\n    The order of checking for win/lose conditions is as follows assuming player A just made the move and player B now needs to move:\n    Check if a rabbit of player A reached goal. If so player A wins.\n    Check if a rabbit of player B reached goal. If so player B wins.\n    Check if player B lost all rabbits. If so player A wins.\n    Check if player A lost all rabbits. If so player B wins.\n    Check if player B has no possible move (all pieces are frozen or have no place to move). If so player A wins.\n    Check if the only moves player B has are 3rd time repetitions. If so player A wins.\n    Reference URLs:\n    http://arimaa.com/arimaa/learn/matchRules.html\n    http://arimaa.com/arimaa/learn/",
"awards_attributes": [{"value": "$17,000", "description": "Note: Award value varies per year."}],
"deadlines_attributes": [{"date": "Mon Jun 24 20:21:28 PDT 2013", "description": "Note: The 2013 competition has ended without a winner. See website for upcoming 2014 Competition."}],
"post_date": "January, 1, 2004",
"image_url": "http://arimaa.com/arimaa/graphics/animals/WE.gif",
"sponsor": "Omar Syed",
"contact_info": "http://arimaa.com/arimaa/contact/",
"topic": "Artificital Intelligence\n    Computer Science\n    Games",
"structure": "Tournament\n    Annual\n    Until Prize is Claimed",
"resultant": "Winner\n    Open Source?",
"xpath_check": "http://arimaa.com/arimaa/challenge/html/body/table/tbody/tr/td[2]/blockquote/table/tbody/tr/td/p[3]"
}]